anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
/* ili9486test --- ILI9486 parallel interfaced LCD test     2020-10-21 */
/* Copyright (c) 2020 John Honniball. All rights reserved              */

/*
 * Created: 2020-10-21 22:28
 */

#include <stdio.h>
#include <math.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>

// PIC32MX360F512L Configuration Bit Settings
 
// 'C' source line config statements
 
// DEVCFG3
// USERID = No Setting
 
// DEVCFG2
#pragma config FPLLIDIV = DIV_2         // PLL Input Divider (2x Divider)
#pragma config FPLLMUL = MUL_20         // PLL Multiplier (20x Multiplier)
#pragma config FPLLODIV = DIV_4         // System PLL Output Clock Divider (PLL Divide by 4)
#pragma config UPLLIDIV = DIV_4         // 
#pragma config UPLLEN = ON              // 
 
// DEVCFG1
#pragma config FNOSC = PRIPLL           // Oscillator Selection Bits (Fast RC Osc with PLL)
#pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disabled)
#pragma config IESO = OFF               // Internal/External Switch Over (Disabled)
#pragma config POSCMOD = HS            // Primary Oscillator Configuration (Primary osc disabled)
#pragma config OSCIOFNC = OFF            // CLKO Output Signal Active on the OSCO Pin (Enabled)
#pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor Selection (Clock Switch Disable, FSCM Disabled)
#pragma config WDTPS = PS1048576        // Watchdog Timer Postscaler (1:1048576)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))
 
// DEVCFG0
#pragma config DEBUG = OFF              // Background Debugger Enable (Debugger is disabled)
#pragma config JTAGEN = OFF             // 
#pragma config ICESEL = ICS_PGx2        // ICE/ICD Comm Channel Select (ICE EMUC2/EMUD2 pins shared with PGC2/PGD2)
#pragma config PWP = OFF                // Program Flash Write Protect (Disable)
#pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
#pragma config CP = OFF                 // Code Protect (Protection Disabled)
 
// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.
 
#include <xc.h>
#include <sys/attribs.h>

// Fonts: Inconsolata
// convert -resize 32x32\! -font Liberation-Mono +dither -pointsize 144 label:B B.xbm

// PIC32 with 128k RAM: PIC32MX795F512L-80I/PT

#include "P1030550_tiny.h"
#include "CHGUK01.h"

#define LED1        LATAbits.LATA6
#define LED2        LATBbits.LATB9

#define GRAT_HT  (256)
#define GRAT_WD  (256)

#define GRATICULE (32)

typedef uint16_t iliColr;

// 16-bit 5-6-5 RGB colour definitions
#define ILI9486_BLACK   (0x0000u)
#define ILI9486_BLUE    (0x001Fu)
#define ILI9486_RED     (0xF800u)
#define ILI9486_GREEN   (0x07E0u)
#define ILI9486_CYAN    (0x07FFu)
#define ILI9486_MAGENTA (0xF81Fu)
#define ILI9486_YELLOW  (0xFFE0u)
#define ILI9486_WHITE   (0xFFFFu)

#define ILI9486_ORANGE  0xFC00

// LCD controller commands
#define ILI9486_NOP         (0x00)  // No operation
#define ILI9486_RESET       (0x01)  // Soft Reset
#define ILI9486_READID      (0x04)  // Read display identification information
#define ILI9486_READNERRORS (0x05)  // Read number of errors on DSI
#define ILI9486_READSTATUS  (0x09)  // Read Display Status
#define ILI9486_SLEEP_IN    (0x10)  // Sleep IN
#define ILI9486_SLEEP_OUT   (0x11)  // Sleep OUT
#define ILI9486_DISPLAY_OFF (0x28)  // Display off
#define ILI9486_DISPLAY_ON  (0x29)  // Display on
#define ILI9486_COL_ADDR    (0x2a)  // Column Address Set
#define ILI9486_PAGE_ADDR   (0x2b)  // Page Address Set
#define ILI9486_MEMORY_WR   (0x2c)  // Memory Write
#define ILI9486_MEMORY_RD   (0x2e)  // Memory Read
#define ILI9486_PARTIALAREA (0x30)  // Partial Area
#define ILI9486_MEMACCTRL   (0x36)  // Memory Access Control
#define ILI9486_IFPIXELFMT  (0x3a)  // Interface Pixel Format
#define ILI9486_IFMODECTRL  (0xb0)  // Interface Mode Control
#define ILI9486_POWERCTRL1  (0xc0)  // Power Control 1
#define ILI9486_POWERCTRL2  (0xc1)  // Power Control 2
#define ILI9486_POWERCTRL3  (0xc2)  // Power Control 3
#define ILI9486_POWERCTRL4  (0xc3)  // Power Control 4
#define ILI9486_POWERCTRL5  (0xc4)  // Power Control 5
#define ILI9486_VCOMCTRL1   (0xc5)  // VCOM Control 1
#define ILI9486_PGAMCTRL    (0xe0)  // PGAMCTRL (Positive Gamma Control)
#define ILI9486_NGAMCTRL    (0xe1)  // NGAMCTRL (Negative Gamma Control)
#define ILI9486_DGAMCTRL1   (0xe2)  // DGAMCTRL1 (Digital Gamma Control 1)
#define ILI9486_DGAMCTRL2   (0xe3)  // DGAMCTRL2 (Digital Gamma Control 2)

#define RGB_ILI(r, g, b)  (((r & 0xf8) << 8) | ((g & 0xfc) << 3) | (b >> 3))

struct ColourScheme {
    iliColr trace1;
    iliColr trace2;
    iliColr trace3;
    iliColr trace4;
    iliColr xcursor1;
    iliColr xcursor2;
    iliColr ycursor1;
    iliColr ycursor2;
    iliColr trig;
    iliColr graticule;
    iliColr background;
};

const struct ColourScheme LCDColours = {
    .trace1 = ILI9486_YELLOW,
    .trace2 = ILI9486_CYAN,
    .trace3 = ILI9486_MAGENTA,
    .trace4 = ILI9486_BLUE,
    .xcursor1 = ILI9486_WHITE,
    .xcursor2 = ILI9486_WHITE,
    .ycursor1 = ILI9486_GREEN,
    .ycursor2 = ILI9486_GREEN,
    .trig = ILI9486_ORANGE,
    .graticule = RGB_ILI(128, 128, 128),
    .background = ILI9486_BLACK,
};

iliColr C1grat[GRAT_HT];
iliColr C2grat[GRAT_HT];
iliColr Bgrat[GRAT_HT];
iliColr Dgrat[GRAT_HT];
iliColr Tgrat[GRAT_HT];
iliColr Wgrat[GRAT_HT];
    
#define UART_RX_BUFFER_SIZE  (128)
#define UART_RX_BUFFER_MASK (UART_RX_BUFFER_SIZE - 1)
#if (UART_RX_BUFFER_SIZE & UART_RX_BUFFER_MASK) != 0
#error UART_RX_BUFFER_SIZE must be a power of two and <= 256
#endif

#define UART_TX_BUFFER_SIZE  (128)
#define UART_TX_BUFFER_MASK (UART_TX_BUFFER_SIZE - 1)
#if (UART_TX_BUFFER_SIZE & UART_TX_BUFFER_MASK) != 0
#error UART_TX_BUFFER_SIZE must be a power of two and <= 256
#endif

struct UART_RX_BUFFER
{
    volatile uint8_t head;
    volatile uint8_t tail;
    uint8_t buf[UART_RX_BUFFER_SIZE];
};

