anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
        if ((y % GRATICULE) == 0)
            Bgrat[y] = cp->graticule;
        else
            Bgrat[y] = cp->background;

        if ((y % 8) == 0)
            Dgrat[y] = cp->graticule;
        else
            Dgrat[y] = cp->background;

        if ((y == 1) || (y == ((GRAT_HT / 2) + 1)) || (y == ((GRAT_HT / 2) - 1)) || (y == (GRAT_HT - 2)) || ((y % GRATICULE) == 0))
            Tgrat[y] = cp->graticule;
        else
            Tgrat[y] = cp->background;

        if ((y % 2) == 0)
            C1grat[y] = cp->xcursor1;
        else
            C1grat[y] = cp->background;

        if ((y % 2) == 0)
            C2grat[y] = cp->xcursor2;
        else
            C2grat[y] = cp->background;
    }
}


void interpolateY(const uint8_t wave[], const int x, const int yoff, iliColr pixels[], const iliColr colr)
{
    int y1, y2;
    int y;

    y1 = wave[x] + yoff;

    if (x < (GRAT_WD - 1))
        y2 = wave[x + 1] + yoff;
    else
        y2 = y1;

    if ((y1 > 0) && (y1 < GRAT_HT) && (y2 > 0) && (y2 < GRAT_HT))
    {
        if (y2 < y1)
        {
            y = y1;
            y1 = y2;
            y2 = y;
        }

        for (y = y1; y <= y2; y++)
            pixels[y] = colr;
    }
}


void ili9486_renderFont(const int x1, const int y1, const iliColr fg, const iliColr bg, const uint8_t *const str)
{
    const int len = strlen(str);
    const int wd = len * 8;
    const int ht = 8;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    uint8_t bits, mask;
    iliColr pixel;
    
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);
    
    PMADDRbits.CS1 = 1;     // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    for (row = 0; row < 8; row++)
    {
        for (i = 0; i < len; i++)
        {
            bits = TileGlyph[str[i]][row];
            
            for (col = 0; col < 8; col++)
            {
                mask = 0x80 >> col;
                
                if (mask & bits)
                {
                    pixel = fg;
                }
                else
                {
                    pixel = bg;
                }
                
                while (PMMODEbits.BUSY)
                    ;

                PMDIN = pixel;
            }
        }
    }
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.CS1 = 0;     // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


void main(void)
{
    unsigned int before, after;
    int x, y;
    uint8_t str[32];
    iliColr pixels[GRAT_HT];
    uint8_t wave1[GRAT_WD];
    uint8_t wave2[GRAT_WD];
    uint8_t wave3[GRAT_WD];
    uint8_t wave4[GRAT_WD];
    float theta1, delta1;
    float theta2, delta2;
    float offset1 = 128.0;
    float offset2 = 192.0;
    bool cursorMode = true;
    int xcursor1 = 34, xcursor2 = 241;
    int ycursor1 = 54, ycursor2 = 237;
    int yshift1 = 22;
    int yshift2 = -22;
    int yshift3 = 64;
    int yshift4 = 32;
    static uint16_t pixMap[64] = {0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000,  // black/white
                                  0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff}; // black/white
    
    /* Set up peripherals to match pin connections on PCB */
    PPS_begin();
    
    /* Configure tri-state registers */
    TRIS_begin();
    
    UART3_begin(9600);
    
    PMP_begin();
    
    /* Configure Timer 1 */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    __asm__("EI");              // Global interrupt enable
    
    puts("ILI9486TEST");
    
    ili9486_begin();
    
    generateGraticule(&LCDColours);
    
    // Synthesise four dummy waveforms
    delta1 = (M_PI * 4.0) / (float)GRAT_WD;
    delta2 = (M_PI * 8.0) / (float)GRAT_WD;

    for (x = 0; x < GRAT_WD; x++)
    {
        theta1 = (float)x * delta1;
        theta2 = (float)x * delta2;

        wave1[x] = (sin(theta1) * 50.0) + offset1;
        wave2[x] = (sin(theta2) * 50.0) + offset2;
        wave3[x] = sin(theta1) > 0.0? 32: 0;
        wave4[x] = sin(theta2) > 0.0? 32: 0;
    }
   
    
    ili9486_fill(ILI9486_WHITE, 480u * 320u);
    
    while (1)
    {
        LED1 = 0;
        LED2 = 1;
        ili9486_fillRect(0, 0, 319, 0, ILI9486_WHITE);
        
        delayms(500);
               
        LED1 = 1;
        LED2 = 1;
        ili9486_pixMap(8, 8, 8, 8, pixMap);
        ili9486_pixMap((320 - 64) / 2, 8, 64, 64, (const uint16_t *)Image);
        
        ili9486_fillRect(0, 80, 319, 319 + 80, ILI9486_ORANGE);
        
        before = millis();
        ili9486_fillRect(32, 112, 255 + 32, 255 + 112, ILI9486_WHITE);
        after = millis();
        ili9486_fillRect(64, 144, 191 + 64, 191 + 144, ILI9486_RED);
        ili9486_fillRect(96, 176, 127 + 96, 127 + 176, ILI9486_GREEN);
        ili9486_fillRect(128, 208, 63 + 128, 63 + 208, ILI9486_BLUE);
        printf("\n256x256 pixels took %dms\n", after - before);
                
        delayms(500);
        
        LED1 = 0;
        LED2 = 0;
        ili9486_fillRect(0, 0, 319, 0, ILI9486_MAGENTA);
        
        before = millis();
        
        for (x = 0; x < GRAT_WD; x++)
        {
            memcpy(pixels, C1grat, sizeof (pixels));
        }
        
        after = millis();
        printf("\n%dx%d byte memcpy() took %dms\n", GRAT_WD, sizeof (pixels), after - before);
        
        before = millis();
        
        for (x = 0; x < GRAT_WD; x++)
        {
            ili9486_pixMap(x + ((320 - GRAT_WD) / 2), (480 - GRAT_HT) / 2, 1, GRAT_HT, pixels);
        }
        
        after = millis();
        printf("\n%dx%d ili9486_pixMap() took %dms\n", GRAT_WD, GRAT_HT, after - before);
        
        delayms(500);
        
        if (PORTAbits.RA1 == 0)
        {
            fputs("PRESSED!", stdout);
        }
        else
        {
            printf("%X", 0xdeadbeef);
        }
        
