anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
        LED1 = 1;
        LED2 = 0;
        
        before = millis();
        
        for (x = 0; x < GRAT_WD; x++)
        {
            // Draw the graticule, cursors or background
            if ((cursorMode == true) && (x == xcursor1))
                memcpy(pixels, C1grat, sizeof (pixels));
            else if ((cursorMode == true) && (x == xcursor2))
                memcpy(pixels, C2grat, sizeof (pixels));
            else if ((x == 1) || (x == ((GRAT_WD / 2) + 1)) || (x == ((GRAT_WD / 2) - 1)) || (x == (GRAT_WD - 2)))
                memcpy(pixels, Dgrat, sizeof (pixels));
            else if ((x % GRATICULE) == 0)
                memcpy(pixels, Wgrat, sizeof (pixels));
            else if ((x % 8) == 0)
                memcpy(pixels, Tgrat, sizeof (pixels));
            else
                memcpy(pixels, Bgrat, sizeof (pixels));
            
            // Add two Y-cursors
            if ((cursorMode == true) && ((x % 2) == 0)) {
                pixels[ycursor1] = LCDColours.ycursor1;
                pixels[ycursor2] = LCDColours.ycursor2;
            }
            
            // Add the four waveforms
            interpolateY(wave1, x, yshift1, pixels, LCDColours.trace1);
            interpolateY(wave2, x, yshift2, pixels, LCDColours.trace2);
            interpolateY(wave3, x, yshift3, pixels, LCDColours.trace3);
            interpolateY(wave4, x, yshift4, pixels, LCDColours.trace4);
        
            ili9486_pixMap(x + ((320 - GRAT_WD) / 2), (480 - GRAT_HT) / 2, 1, GRAT_HT, pixels);
        }
        
        after = millis();
        printf("\n%dx%d scope display took %dms\n", GRAT_WD, GRAT_HT, after - before);
        
        ili9486_fillRect(0, 0, 319, 0, ILI9486_GREEN);
        
        delayms(500);
        
        LED1 = 1;
        LED2 = 0;
        ili9486_fillRect(0, 0, 319, 0, ILI9486_ORANGE);
        
        before = millis();
        
        for (y = 0; y < 16; y++)
        {
            for (x = 0; x < 16; x++)
            {
                uint8_t ch = (y * 16) + x;
                
                if (ch == 0)
                    ch = ' ';
                
                str[x] = ch;
            }
            
            str[16] = '\0';
            
            ili9486_renderFont((320 - (16 * 8)) / 2, (y * 8) + ((480 - (16 * 8)) / 2), ILI9486_GREEN, ILI9486_BLACK, str);
        }
        
        after = millis();
        printf("\n%dx%d characters took %dms\n", 16, 16, after - before);
        
        delayms(500);
    }
}
